IDEA StatiCa Open Model
TemperatureCurve2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Reperesents a thermal curve.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Polygon2D
 IdeaRS.OpenModel.Geometry2D.TemperatureCurve2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TemperatureCurve2D : Polygon2D
Public Class TemperatureCurve2D
	Inherits Polygon2D
public ref class TemperatureCurve2D : public Polygon2D
The TemperatureCurve2D type exposes the following members.
Constructors
Name | Description
TemperatureCurve2D
 Constructor
Top
Properties
Name | Description
Points
 List of polygon points
 (Inherited from Polygon2D.)
Temperature
 The temperature [K]
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace